renesas/rx-driver-package/source/r_riic_rx/r_riic_rx_vx.xx/r_riic_rx/src/targets/rx660/r_riic_rx660.c
/***********************************************************************************************************************
 * Function Name: riic0_txi_isr
 * Description  : Interrupt TXI handler for channel 0.
 *                Types of interrupt requests transmission data empty.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(riic0_txi_isr, VECT(RIIC0, TXI0))
R_BSP_ATTRIB_STATIC_INTERRUPT void riic0_txi_isr (void)
{
    riic0_txi_sub();
} /* End of function riic0_txi_isr() */

/***********************************************************************************************************************
 * Function Name: riic0_rxi_isr
 * Description  : Interrupt RXI handler for channel 0.
 *                Types of interrupt requests reception end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(riic0_rxi_isr, VECT(RIIC0, RXI0))
R_BSP_ATTRIB_STATIC_INTERRUPT void riic0_rxi_isr (void)
{
    riic0_rxi_sub();
} /* End of function riic0_rxi_isr() */

/***********************************************************************************************************************
 * Function Name: riic0_tei_isr
 * Description  : Interrupt TEI handler for channel 0.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riic0_tei_isr (void * vect)
{
    riic0_tei_sub();
} /* End of function riic0_tei_isr() */
    #endif

    #if (1U == RIIC_CFG_CH2_INCLUDED)
/***********************************************************************************************************************
 * Function Name: riic2_eei_isr
 * Description  : Interrupt EEI handler for channel 2.
 *                Types of interrupt requests transfer error or event generation.
 *                The event generations are arbitration-lost, NACK detection, timeout detection, 
 *                start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riic2_eei_isr(void * vect)
{
    riic2_eei_sub();
} /* End of function riic2_eei_isr() */

/***********************************************************************************************************************
 * Function Name: riic2_txi_isr
 * Description  : Interrupt TXI handler for channel 2.
 *                Types of interrupt requests transmission data empty.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(riic2_txi_isr, VECT(RIIC2, TXI2))
R_BSP_ATTRIB_STATIC_INTERRUPT void riic2_txi_isr (void)
{
    riic2_txi_sub();
} /* End of function riic2_txi_isr() */

/***********************************************************************************************************************
 * Function Name: riic2_rxi_isr
 * Description  : Interrupt RXI handler for channel 2.
 *                Types of interrupt requests reception end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(riic2_rxi_isr, VECT(RIIC2, RXI2))
R_BSP_ATTRIB_STATIC_INTERRUPT void riic2_rxi_isr (void)
{
    riic2_rxi_sub();
} /* End of function riic2_rxi_isr() */

/***********************************************************************************************************************
 * Function Name: riic2_tei_isr
 * Description  : Interrupt TEI handler for channel 2.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void riic2_tei_isr(void * vect)
{
    riic2_tei_sub();
} /* End of function riic2_tei_isr() */
    #endif

#endif /* defined(BSP_MCU_RX660) */
